#دستورات پرينتت
#تعفير متغير ها
#قوانین نام گذاری متغیرها در پایتون
#فاطمه کتاب داستانی را در 6 ساعت مطالعه کرد و 10 صفحه از آن باقی ماند. اگر این کتاب 100 صفحه داشته باشد، فاطمه
#به طور متوسط در هر ساعت چند صفحه از آن را مطالعه کرده است؟
page_read=100-10
speed_read=page_read/6
print("سرعت خواندن کتاب توسط فاطمه برابر است با=   ",speed_read )

#محاسبه کن یک ساعت و بیست دقیقه و سی ثانیه، چند ثانیه است.
second_hour=1*60*60
second_minut=20*60
second=30
total_second=second_hour+second_minut+second
print("کل ثانيه براي يک ساعت و 25 دقيقه و 30ثانيه برابر است با=  ",total_second)

#مساحت و محیط یک دایره با شعاع 5 چقدر است؟
r=5
S=3.14*5*r
P=2*3.14*r
print("مساحت دايره به شعاع 5 برابر است با:  ", S)
print("محيط دايره به شعاع 5 برابر است با:   ", P)

# پس انداز هفتگی محمد، 3000 تومان است. او حساب کرد 5 هفته پس انداز او، نصف قیمت کیفی است که دوست دارد آن
#را بخرد.برنامه ای بنویسید که قیمت کیف را محاسبه و چاپ کند.
Pasandaz_hafte=3000
Pasandaz_5_hafte=Pasandaz_hafte*5
Kif_ghimat=Pasandaz_5_hafte*2
print("قيمت کيف برابر است با:   ", Kif_ghimat)
