# Projects Page 65
#برنامه ای بنویسید که سه عدد از ورودی دریافت و سپس عدد بزرگ تر را چاپ کند.
#a=int(input("عدد اول را وارد نماييد"))
#b=int(input("عدد دوم را وارد نماييد"))
#c=int(input("عدد سوم را وارد نماييد"))
#max=a

#if b>max:
#    max=b
#if c>max:
#    max=c
#print("maximum is : ", max)

#لطفا براي کوچکترين عدد  اين برنامه رو بنويسيد

#Admin 12345678

#username=input("لطفا نام کاربري را وارد نماييد")
#password=int(input("لطفا کلمه ي عبور را وارد نماييد"))

#if username=="Admin"  and password==12345678:
#    print("خوش آمديد")
#else:
#    print("مجوز صادر نشد")

#برنامه ای بنویسید که طول سه پاره خط را از ورودی دریافت و سپس مشخص کند که آیا می توان با این سه پاره خط مثلثی رسم
a=int(input("پاره خط 1"))
b=int(input("پاره خط 2"))
c=int(input("پاره خط 3"))

if a<(b+c) and b<(a+c) and c<(a+b):
    print("مثلث قابل رسم است")
else:
    print("مثلث قابل رسم نيست")
